# GetVPLrOvrdOpty

## Description
Gets the opacity for a layer override.

```pascal
FUNCTION GetVPLrOvrdOpty(
				viewportHandle : HANDLE;
				layerHandle    : HANDLE) : INTEGER;
```

```python

def vs.GetVPLrOvrdOpty(viewportHandle, layerHandle):
    return INTEGER
```

## Parameters
|Name|Type|Description|
|---|---|---|
|viewportHandle|HANDLE|The viewport handle.|
|layerHandle|HANDLE|The layer handle.|

## Returns
Returns the opacity for a layer override (0-100).

## See Also
VS Functions:
SetVPLrOvrdOpty

## Version
Availability: from Vectorworks 2014
## Category
* Viewports